import math
try:
    a = int(input("Zadej obsah čtverce: "))
    print(math.sgrt(a))
seznam = [a, l, a, h, j, e, m, o, c, n, y]
except ValueError:
    print("""轉為手機模式 简体English本站介紹
　簡介
　字體試驗頁
　+協助
　+常見問答集
　+使用說明
　+工具
　系統統計
　+數位人文
先秦兩漢
儒家
墨家
道家
法家
名家
兵家
算書
雜家
史書
經典文獻
字書
醫學
出土文獻

漢代之後
魏晉南北朝
隋唐
宋明
清代
民國
簡介說明
相關資料
字典
討論區
圖書館
維基
數據維基
在
先秦兩漢
中檢索：

 高級檢索
書名檢索：

登入
在Facebook上關注我們，隨時得到最新消息 在Twitter上關注我們，隨時得到最新消息 在新浪微博上關注我們，隨時得到最新消息 在豆瓣上關注我們，隨時得到最新消息
中國哲學書電子化計劃	中國哲學書電子化計劃
歡迎
歡迎您來到中國哲學書電子化計劃首頁。中國哲學書電子化計劃是一個線上開放電子圖書館，為中外學者提供中國歷代傳世文獻，力圖超越印刷媒體限制，通過電子科技探索新方式與古代文獻進行溝通。收藏的文本已超過三萬部著作，並有五十億字之多，故為歷代中文文獻資料庫最大者。 歡迎參閱先秦兩漢、漢代之後或維基區資料庫目錄，或參考系統簡介、常見問答集、使用說明和相關工具。若欲尋找特定著作，可使用書名檢索功能一併檢索本站各種主要原典資料。

本站所提供的資料和服務都不收費，因此網站所需要的資金全來自捐款。若您願意捐款補助，請參閲相關說明。感謝您的支持。

最新消息
日期	內容RSS
2016-10-10	哈佛燕京圖書館歷代中文文獻已收錄
通過哈佛燕京圖書館的支持，本站電子圖書館已收錄燕京圖書館五百多萬頁歷代中文文獻的影印資料，其中包括中文善本特藏項目中的高質量影印本。本站字符識別技術已將資料加以文字化，現已放入本站維基區，並實現了資料的全文檢索。希望將來能夠與其它收藏中國古籍的圖書館合作，以提供更豐富更全面的資料。
2015-07-02	統一碼8.0升級，增加新漢字字形
統一碼標準最近推出新版本，增加了數千新的罕見字、異體字。本站字典功能現已支持這些新字的查詢，使用者安裝花園字體的最新版本即可顯示這些新增字形。許多新增字形屬於「CJK擴展E區」；您可以參考字體試驗頁面以確認您的系統是否支持這些字。
完整的更新記錄存放於「最新消息」討論區。請注意：上述最新消息只包括最主要的技術升級項目。若想要參考文獻內容的更新記錄，登入後可另外參考維基修改記錄的各種項目。

最新討論主題
日期	內容RSS
2023-03-30
發言者kalexchu	Missing page
https://ctext.org/library.pl?if=en&file=54560&page=138
This page contains the transcript for two pages, one of which is missing a screenshot. [更多...]
2023-03-11
發言者stonechi8	几本琴譜書粗略校正
https://ctext.org/library.pl?if=gb&res=3162
《 [更多...] [2條回覆]
2023-02-19
發言者stonechi8	輯佚《通俗文》OCR文字更正完成
原載于《玉函山房輯佚書目 卷六十一》
但原書掃描版本不够清晰。
另一版本以《通俗文》爲名，较爲清 [更多...] [3條回覆]
字體及兼容性
本網站上的古書使用到大量頗爲少見的漢字。爲了顯示這些漢字，您的電腦必須具備一個支持這些字的Unicode字體（尤其是支持「CJK擴展A區」至「D區」中的字）， 否則您的電腦將無法顯示這些字。一個很恰當的字體是可免費下載的「花園」字體；「Han Nom」也支持擴展A和B區的字，但不支持C或D區。 此外，您的電腦必須全面支持統一碼（Unicode），包括所謂代理字（Surrogates）；這有可能會使得舊版系統軟件無法顯示這些字。 您可以參考字體試驗頁確定您的電腦目前支持哪些漢字。

本網站符合W3C標準，因此使用任何支持標準的遊覽器都能用。可是因爲開發的重點放在可用性而不在兼容性， 目前如果使用舊版遊覽器，有可能會遇到問題。我建議大家安裝全面支持CSS的遊覽器，比如Mozilla Firefox， 這樣才能保證能使用本網站的所有功能。

喜歡我們的網站？請支持我們的發展。	網站的設計與内容(c)版權2006-2023。如果您想引用本網站上的内容，請同時加上至本站的鏈接：https://ctext.org/zh。請注意：嚴禁使用自動下載軟体下載本網站的大量網頁，違者自動封鎖，不另行通知。沪ICP备09015720号-3	若有任何意見或建議，請在此提出。
""")
